### TF Part # 1
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`

  <details><summary>Show Plan</summary>

  ```

  [command]/home/runner/work/_temp/a640b7d6-47f7-46e3-9678-e4257294bd25/terraform-bin show -no-color tf.plan
2023-08-04T14:15:29.100Z [INFO]  Terraform version: 1.5.4
2023-08-04T14:15:29.101Z [INFO]  Go runtime version: go1.20
2023-08-04T14:15:29.101Z [INFO]  CLI args: []string{"/home/runner/work/_temp/a640b7d6-47f7-46e3-9678-e4257294bd25/terraform-bin", "show", "-no-color", "tf.plan"}
2023-08-04T14:15:29.102Z [INFO]  CLI command args: []string{"show", "-no-color", "tf.plan"}
2023-08-04T14:15:29.338Z [INFO]  provider: configuring client automatic mTLS
2023-08-04T14:15:29.424Z [INFO]  provider.terraform-provider-google_v4.73.0_x5: configuring server automatic mTLS: timestamp=2023-08-04T14:15:29.424Z

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_monitoring_alert_policy.alert_policy will be created
  + resource "google_monitoring_alert_policy" "alert_policy" {
      + combiner        = "OR"
      + creation_record = (known after apply)
      + display_name    = "[GKE Container] - High CPU Limit Utilization (esgk-gke-res-prod-ue4-cluster-01 cluster)"
      + enabled         = true
      + id              = (known after apply)
      + name            = (known after apply)
      + project         = "advizir-dev"
      + user_labels     = {
          + "foo" = "bar"
        }

      + conditions {
          + display_name = "GKE container in esgk-gke-res-prod-ue4-cluster-01 cluster has high CPU limit utilization"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "60s"
              + filter          = "resource.type = \"k8s_container\" AND (resource.labels.cluster_name = \"esgk-gke-res-prod-ue4-cluster-01\" AND resource.labels.location = \"us-east4\") AND metric.type = \"kubernetes.io/container/cpu/limit_utilization\""
              + threshold_value = 0

              + aggregations {
                  + alignment_period   = "300s"
                  + per_series_aligner = "ALIGN_MEAN"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_monitoring_alert_policy.alert_policy will be created%0A  + resource "google_monitoring_alert_policy" "alert_policy" {%0A      + combiner        = "OR"%0A      + creation_record = (known after apply)%0A      + display_name    = "[GKE Container] - High CPU Limit Utilization (esgk-gke-res-prod-ue4-cluster-01 cluster)"%0A      + enabled         = true%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + project         = "advizir-dev"%0A      + user_labels     = {%0A          + "foo" = "bar"%0A        }%0A%0A      + conditions {%0A          + display_name = "GKE container in esgk-gke-res-prod-ue4-cluster-01 cluster has high CPU limit utilization"%0A          + name         = (known after apply)%0A%0A          + condition_threshold {%0A              + comparison      = "COMPARISON_GT"%0A              + duration        = "60s"%0A              + filter          = "resource.type = \"k8s_container\" AND (resource.labels.cluster_name = \"esgk-gke-res-prod-ue4-cluster-01\" AND resource.labels.location = \"us-east4\") AND metric.type = \"kubernetes.io/container/cpu/limit_utilization\""%0A              + threshold_value = 0%0A%0A              + aggregations {%0A                  + alignment_period   = "300s"%0A                  + per_series_aligner = "ALIGN_MEAN"%0A                }%0A            }%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 2023-08-04T14:15:29.100Z [INFO]  Terraform version: 1.5.4%0A2023-08-04T14:15:29.101Z [INFO]  Go runtime version: go1.20%0A2023-08-04T14:15:29.101Z [INFO]  CLI args: []string{"/home/runner/work/_temp/a640b7d6-47f7-46e3-9678-e4257294bd25/terraform-bin", "show", "-no-color", "tf.plan"}%0A2023-08-04T14:15:29.102Z [INFO]  CLI command args: []string{"show", "-no-color", "tf.plan"}%0A2023-08-04T14:15:29.338Z [INFO]  provider: configuring client automatic mTLS%0A2023-08-04T14:15:29.424Z [INFO]  provider.terraform-provider-google_v4.73.0_x5: configuring server automatic mTLS: timestamp=2023-08-04T14:15:29.424Z%0A
::debug::exitcode: 0

  ```

  </details>

  *Pusher: @misrarm, Action: `pull_request`, Workflow: `[TF] Applying Infra Changes`*